# BuiltInFailures.LinkFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LinkFailures Class
BuiltInFailures Class Members See Also
---
Failures about LinkFailures.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class LinkFailures
```

Visual Basic
---
```text
Public NotInheritable Class LinkFailures
```

Visual C++
---
```text
public ref class LinkFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..LinkFailures
# See Also
BuiltInFailures..::..LinkFailures Members
Autodesk.Revit.DB Namespace